kaggle competition: [Predict Future Sales](https://www.kaggle.com/c/competitive-data-science-predict-future-sales/data?select=sample_submission.csv)

Predicting future sales using SKlearn Regression model.

In [ ]:
# 数値計算に必要なライブラリ
import numpy as np
import pandas as pd
# グラフを描画するパッケージ
import matplotlib.pyplot as plt
# 機械学習ライブラリscikit-learnの線形モデル
from sklearn.linear_model import LinearRegression

In [1]:
# show sample submission data

df = pd.read_csv('../data/sample_submission.csv')
print(df)

            ID  item_cnt_month
0            0             0.5
1            1             0.5
2            2             0.5
3            3             0.5
4            4             0.5
...        ...             ...
214195  214195             0.5
214196  214196             0.5
214197  214197             0.5
214198  214198             0.5
214199  214199             0.5

[214200 rows x 2 columns]

In [39]:
item_df = pd.read_csv("../data/items.csv")
date_train_df = pd.read_csv('../data/sales_train.csv')

In [40]:
date_train_df.dtypes

date               object
date_block_num      int64
shop_id             int64
item_id             int64
item_price        float64
item_cnt_day      float64
dtype: object

In [45]:
# マイナスの値をプラスに置換
date_train_df.loc[date_train_df["item_cnt_day"] < 0, "item_cnt_day"] = date_train_df["item_cnt_day"] * -1

In [46]:
date_train_df

,date,date_block_num,shop_id,item_id,item_price,item_cnt_day
0,02.01.2013,0,59,22154,999.00,1.0
1,03.01.2013,0,25,2552,899.00,1.0
2,05.01.2013,0,25,2552,899.00,1.0
3,06.01.2013,0,25,2554,1709.05,1.0
4,15.01.2013,0,25,2555,1099.00,1.0
...,...,...,...,...,...,...
2935844,10.10.2015,33,25,7409,299.00,1.0
2935845,09.10.2015,33,25,7460,299.00,1.0
2935846,14.10.2015,33,25,7459,349.00,1.0
2935847,22.10.2015,33,25,7440,299.00,1.0
2935848,03.10.2015,33,25,7460,299.00,1.0

In [48]:
X = date_train_df.drop("item_cnt_day", axis=1)
Y = date_train_df["item_cnt_day"]
print(X.head())
print(Y.head())

         date  date_block_num  shop_id  item_id  item_price
0  02.01.2013               0       59    22154      999.00
1  03.01.2013               0       25     2552      899.00
2  05.01.2013               0       25     2552      899.00
3  06.01.2013               0       25     2554     1709.05
4  15.01.2013               0       25     2555     1099.00
0    1.0
1    1.0
2    1.0
3    1.0
4    1.0
Name: item_cnt_day, dtype: float64

In [ ]:
mo